clear; clc;

%Исходные данные
x = 2.5378; dx = 0.0001;
y = 2.536; dy = 0.001;

%Сумма
S1 = x+y;
%Абсолютная погрешность
dS1 = dx+dy;
%Относительная погрешность 1
rel_S1 = dS1/abs(S1);
%Разность
S2 = x-y;
%Абсолютная погрешность
dS2 = dx+dy;
%Относительная погрешность 2
rel_S2 = dS2/abs(S2);

fprintf('Сумма S1 = %.4f\n', S1);
fprintf('Абсолютная погрешность суммы dS1 = %.4f\n', dS1);
fprintf('Относительная погрешность суммы -d-S1 = %.2e\n\n', rel_S1);

fprintf('Разность S2 = %.4f\n', S2);
fprintf('Абсолютная погрешность разности dS2 = %.4f\n', dS2);
fprintf('Относительная погрешность разности -d-S2 = %.2e\n', rel_S2);